Repository: lauyoo46/ProjectICP
Catalog: Incopo/*.lproj/Localizable.strings
Languages: ro

source: Password
ro: Parola

source: Sign In
ro: Logare

source: Sign Up
ro: Inregistrare

source: Forgot password?
ro: Parola uitata?

# Login Error
source: Error
ro: Eroare la Logare

source: Registration failed
ro: Inregistrare esuata

source: First Name must not contain decimals
ro: Prenumele nu poate contine cifre

source: Last Name must not contain decimals
ro: Numele nu poate contine cifre

source: Confirmation field must not be empty
ro: Campul de confirmare a parolei nu poate fi vid

source: Passwords does not match
ro: Parolele nu se potrivesc

source: Registration Error
ro: Eroare la Inregistrare

source: Registration Message
ro: Mesaj inregistrare

source: You registered successfully
ro: Inregistrare efectuata cu succes
